Documents/ПриказОПроведениеМероприятия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ПриказОПроведениеМероприятия</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СотрудникиОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Место</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>План</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоМероприятия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецМероприятия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтчетСформирован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦельОтчет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоМероприятияОтчет</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецМероприятиОтчет</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоОтчет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеОтчет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СотрудникиОрганизацииОтчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьОтчет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоСписком</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОтчет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоСпискомОтчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокМест</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Место</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокМестОтчет</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Место</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПриказОПроведениеМероприятия/Ext/ManagerModule.bsl
Функция  ПриказМероприятий(Документ,ТабличныйДокумент) Экспорт
	
	Макет = Документы.ПриказОПроведениеМероприятия.ПолучитьМакет("ПриказМероприятий");
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	
	ЗаполнитьПараметры(Документ,ОбластьШапка);
	
	ОбластьШапка.Параметры.Заполнить(Документ);
	
	ОбластьШапка.Параметры.ФИОДолжностьСотрудника	= ОбщегоНазначения.ФамилияИнициалыФизЛица(СокрЛП(Документ.СотрудникиОрганизации))
	+" "+ Документ.Должность;	
	
	ОбластьШапка.Параметры.Организация = Документ.Организация.НаименованиеПолное;
	
	Если Документ.МестоСписком Тогда
		
		СписокМест = "";
		
		Для каждого ТекСтрока Из Документ.СписокМест Цикл
		
			СписокМест = СписокМест +  Строка(ТекСтрока.Место) + Символы.ПС;
		
		КонецЦикла;	
		
		СписокМест = Лев(СписокМест,СтрДлина(СписокМест)-1);
		
		ОбластьШапка.Параметры.Место = СписокМест;
	
	КонецЕсли;
	
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Процедура ЗаполнитьПараметры(Документ,ОбластьШапка)

	РуководительФИО = ОбщегоНазначения.ФамилияИнициалыФизЛица(СокрЛП(Документ.Организация.ГенеральныйДиректор));

	РуководительДолжность = СокрЛП(Документ.Организация.должностьРуководителя);

	ОбластьШапка.Параметры.ДолжностьРуководителя  = РуководительДолжность;
	ОбластьШапка.Параметры.ФИОРуководителя  = РуководительФИО;
	
	ОбластьШапка.Параметры.НомерДокумента  = ОбщегоНазначения.ПолучитьНомерНаПечать(Документ);
	ОбластьШапка.Параметры.ДатаСоставления  = Документ.Дата;

КонецПроцедуры

Функция  ОтчетМероприятий(Документ,ТабличныйДокумент) Экспорт
	
	Макет = Документы.ПриказОПроведениеМероприятия.ПолучитьМакет("ОтчетМероприятий");
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	
	//ЗаполнитьПараметры(Документ,ОбластьШапка);
	
	//ОбластьШапка.Параметры.ДолжностьСотудника  = Документ.Должность;
	
	ОбластьШапка.Параметры.Заполнить(Документ);
	
	ОбластьШапка.Параметры.ФИОДолжностьСотрудника	= ОбщегоНазначения.ФамилияИнициалыФизЛица(СокрЛП(Документ.СотрудникиОрганизацииОтчет))
	+" "+ Документ.ДолжностьОтчет;		
	
	Если Документ.МестоСпискомОтчет Тогда
		
		СписокМест = "";
		
		Для каждого ТекСтрока Из Документ.СписокМестОтчет Цикл
		
			СписокМест = СписокМест + Строка(ТекСтрока.Место) + Символы.ПС;
		
		КонецЦикла;	
		
		СписокМест = Лев(СписокМест,СтрДлина(СписокМест)-1);
		
		ОбластьШапка.Параметры.МестоОтчет	= СписокМест;
	
	КонецЕсли;
	ОбластьШапка.Параметры.Организация = Документ.Организация.НаименованиеПолное;
	
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция РасчетДней(ДатаНачала,ДатаОкончания)   
    
    Возврат (НачалоДня(ДатаОкончания) - НачалоДня(ДатаНачала)) / 86400;
        
КонецФункции
